CSI API ETABS v1
cAreaElm.GetObj Method
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetObj(
	string Name,
	ref string Obj
)
Function GetObj (
	Name As String,
	ByRef Obj As String
) As Integer
Dim instance As cAreaElm
Dim Name As String
Dim Obj As String
Dim returnValue As Integer
returnValue = instance.GetObj(Name, Obj)
int GetObj(
	String^ Name,
	String^% Obj
)
abstract GetObj :
        Name : string *
        Obj : string byref -> int
Parameters
Name
Type: System.String
Obj
Type: System.String
Return Value
Type: Int32
See Also
Reference
cAreaElm Interface
ETABSv1 Namespace